; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob1409) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate13)
	(at pallet1 distributor0)
	(clear crate7)
	(at pallet2 distributor1)
	(clear crate11)
	(at pallet3 depot0)
	(clear crate14)
	(at pallet4 distributor0)
	(clear crate10)
	(at pallet5 depot0)
	(clear crate12)
	(at truck0 depot0)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet5)
	(at crate1 distributor0)
	(on crate1 pallet4)
	(at crate2 distributor0)
	(on crate2 pallet1)
	(at crate3 distributor1)
	(on crate3 pallet2)
	(at crate4 distributor0)
	(on crate4 crate2)
	(at crate5 distributor1)
	(on crate5 crate3)
	(at crate6 distributor0)
	(on crate6 crate1)
	(at crate7 distributor0)
	(on crate7 crate4)
	(at crate8 depot0)
	(on crate8 pallet0)
	(at crate9 distributor0)
	(on crate9 crate6)
	(at crate10 distributor0)
	(on crate10 crate9)
	(at crate11 distributor1)
	(on crate11 crate5)
	(at crate12 depot0)
	(on crate12 crate0)
	(at crate13 depot0)
	(on crate13 crate8)
	(at crate14 depot0)
	(on crate14 pallet3)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 pallet5)
		(on crate2 crate5)
		(on crate3 crate13)
		(on crate4 pallet2)
		(on crate5 crate4)
		(on crate6 crate3)
		(on crate7 crate8)
		(on crate8 pallet1)
		(on crate10 crate11)
		(on crate11 pallet0)
		(on crate12 crate0)
		(on crate13 crate12)
	)
))

; plan
1. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 1 of 13
2. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 1 of 13
3. (lift hoist1 crate10 crate9 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist1) (on crate10 crate9)
   added: (lifting hoist1 crate10) (clear crate9)
   goals met: 1 of 13
4. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 1 of 13
5. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 1 of 13
6. (load hoist1 crate10 truck1 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   goals met: 1 of 13
7. (lift hoist1 crate7 crate4 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate4)
   added: (lifting hoist1 crate7) (clear crate4)
   goals met: 1 of 13
8. (load hoist1 crate7 truck1 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   goals met: 1 of 13
9. (lift hoist1 crate4 crate2 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate2)
   added: (lifting hoist1 crate4) (clear crate2)
   goals met: 1 of 13
10. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 1 of 13
11. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 1 of 13
12. (unload hoist2 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist2)
   added: (lifting hoist2 crate10)
   goals met: 1 of 13
13. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 1 of 13
14. (drop hoist2 crate10 crate11 distributor1)
   deleted: (lifting hoist2 crate10) (clear crate11)
   added: (available hoist2) (at crate10 distributor1) (clear crate10) (on crate10 crate11)
   goals met: 2 of 13
15. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   goals met: 2 of 13
16. (drop hoist2 crate4 crate10 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate10)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate10)
   goals met: 2 of 13
17. (lift hoist1 crate2 pallet1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 2 of 13
18. (lift hoist0 crate13 crate8 depot0)
   deleted: (at crate13 depot0) (clear crate13) (available hoist0) (on crate13 crate8)
   added: (lifting hoist0 crate13) (clear crate8)
   goals met: 2 of 13
19. (drop hoist0 crate13 crate12 depot0)
   deleted: (lifting hoist0 crate13) (clear crate12)
   added: (available hoist0) (at crate13 depot0) (clear crate13) (on crate13 crate12)
   goals met: 3 of 13
20. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 3 of 13
21. (lift hoist0 crate8 pallet0 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 pallet0)
   added: (lifting hoist0 crate8) (clear pallet0)
   goals met: 3 of 13
22. (load hoist0 crate8 truck1 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck1) (available hoist0)
   goals met: 3 of 13
23. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 3 of 13
24. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   goals met: 3 of 13
25. (unload hoist1 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 3 of 13
26. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 3 of 13
27. (drop hoist1 crate8 pallet1 distributor0)
   deleted: (lifting hoist1 crate8) (clear pallet1)
   added: (available hoist1) (at crate8 distributor0) (clear crate8) (on crate8 pallet1)
   goals met: 4 of 13
28. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 4 of 13
29. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 4 of 13
30. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 4 of 13
31. (drop hoist1 crate7 crate8 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate8)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate8)
   goals met: 5 of 13
32. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 5 of 13
33. (lift hoist0 crate13 crate12 depot0)
   deleted: (at crate13 depot0) (clear crate13) (available hoist0) (on crate13 crate12)
   added: (lifting hoist0 crate13) (clear crate12)
   goals met: 4 of 13
34. (load hoist0 crate13 truck1 depot0)
   deleted: (lifting hoist0 crate13)
   added: (in crate13 truck1) (available hoist0)
   goals met: 4 of 13
35. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 4 of 13
36. (unload hoist2 crate13 truck1 distributor1)
   deleted: (in crate13 truck1) (available hoist2)
   added: (lifting hoist2 crate13)
   goals met: 4 of 13
37. (drop hoist2 crate13 crate4 distributor1)
   deleted: (lifting hoist2 crate13) (clear crate4)
   added: (available hoist2) (at crate13 distributor1) (clear crate13) (on crate13 crate4)
   goals met: 4 of 13
38. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 4 of 13
39. (lift hoist0 crate12 crate0 depot0)
   deleted: (at crate12 depot0) (clear crate12) (available hoist0) (on crate12 crate0)
   added: (lifting hoist0 crate12) (clear crate0)
   goals met: 3 of 13
40. (load hoist0 crate12 truck1 depot0)
   deleted: (lifting hoist0 crate12)
   added: (in crate12 truck1) (available hoist0)
   goals met: 3 of 13
41. (lift hoist0 crate0 pallet5 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet5)
   added: (lifting hoist0 crate0) (clear pallet5)
   goals met: 3 of 13
42. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 3 of 13
43. (unload hoist1 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   goals met: 3 of 13
44. (drop hoist1 crate12 crate7 distributor0)
   deleted: (lifting hoist1 crate12) (clear crate7)
   added: (available hoist1) (at crate12 distributor0) (clear crate12) (on crate12 crate7)
   goals met: 3 of 13
45. (lift hoist1 crate9 crate6 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate6)
   added: (lifting hoist1 crate9) (clear crate6)
   goals met: 3 of 13
46. (drop hoist1 crate9 crate12 distributor0)
   deleted: (lifting hoist1 crate9) (clear crate12)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 crate12)
   goals met: 3 of 13
47. (lift hoist1 crate6 crate1 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate1)
   added: (lifting hoist1 crate6) (clear crate1)
   goals met: 3 of 13
48. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 3 of 13
49. (lift hoist1 crate1 pallet4 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet4)
   added: (lifting hoist1 crate1) (clear pallet4)
   goals met: 3 of 13
50. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   goals met: 3 of 13
51. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 3 of 13
52. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 3 of 13
53. (drop hoist0 crate0 crate14 depot0)
   deleted: (lifting hoist0 crate0) (clear crate14)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate14)
   goals met: 3 of 13
54. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   goals met: 3 of 13
55. (drop hoist0 crate1 pallet5 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet5)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 pallet5)
   goals met: 4 of 13
56. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 4 of 13
57. (lift hoist0 crate0 crate14 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 crate14)
   added: (lifting hoist0 crate0) (clear crate14)
   goals met: 4 of 13
58. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   goals met: 4 of 13
59. (lift hoist0 crate14 pallet3 depot0)
   deleted: (at crate14 depot0) (clear crate14) (available hoist0) (on crate14 pallet3)
   added: (lifting hoist0 crate14) (clear pallet3)
   goals met: 4 of 13
60. (drop hoist0 crate14 crate1 depot0)
   deleted: (lifting hoist0 crate14) (clear crate1)
   added: (available hoist0) (at crate14 depot0) (clear crate14) (on crate14 crate1)
   goals met: 4 of 13
61. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 4 of 13
62. (drop hoist0 crate0 pallet3 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet3)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet3)
   goals met: 5 of 13
63. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 5 of 13
64. (lift hoist1 crate9 crate12 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate12)
   added: (lifting hoist1 crate9) (clear crate12)
   goals met: 5 of 13
65. (drop hoist1 crate9 pallet4 distributor0)
   deleted: (lifting hoist1 crate9) (clear pallet4)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 pallet4)
   goals met: 5 of 13
66. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 5 of 13
67. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 5 of 13
68. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 5 of 13
69. (lift hoist1 crate12 crate7 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist1) (on crate12 crate7)
   added: (lifting hoist1 crate12) (clear crate7)
   goals met: 5 of 13
70. (load hoist1 crate12 truck1 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   goals met: 5 of 13
71. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 5 of 13
72. (unload hoist0 crate12 truck1 depot0)
   deleted: (in crate12 truck1) (available hoist0)
   added: (lifting hoist0 crate12)
   goals met: 5 of 13
73. (drop hoist0 crate12 crate0 depot0)
   deleted: (lifting hoist0 crate12) (clear crate0)
   added: (available hoist0) (at crate12 depot0) (clear crate12) (on crate12 crate0)
   goals met: 6 of 13
74. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 6 of 13
75. (lift hoist2 crate13 crate4 distributor1)
   deleted: (at crate13 distributor1) (clear crate13) (available hoist2) (on crate13 crate4)
   added: (lifting hoist2 crate13) (clear crate4)
   goals met: 6 of 13
76. (load hoist2 crate13 truck1 distributor1)
   deleted: (lifting hoist2 crate13)
   added: (in crate13 truck1) (available hoist2)
   goals met: 6 of 13
77. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 6 of 13
78. (unload hoist0 crate13 truck1 depot0)
   deleted: (in crate13 truck1) (available hoist0)
   added: (lifting hoist0 crate13)
   goals met: 6 of 13
79. (drop hoist0 crate13 crate12 depot0)
   deleted: (lifting hoist0 crate13) (clear crate12)
   added: (available hoist0) (at crate13 depot0) (clear crate13) (on crate13 crate12)
   goals met: 7 of 13
80. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 7 of 13
81. (lift hoist2 crate4 crate10 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate10)
   added: (lifting hoist2 crate4) (clear crate10)
   goals met: 7 of 13
82. (load hoist2 crate4 truck1 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   goals met: 7 of 13
83. (lift hoist2 crate10 crate11 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate11)
   added: (lifting hoist2 crate10) (clear crate11)
   goals met: 6 of 13
84. (load hoist2 crate10 truck1 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck1) (available hoist2)
   goals met: 6 of 13
85. (lift hoist2 crate11 crate5 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist2) (on crate11 crate5)
   added: (lifting hoist2 crate11) (clear crate5)
   goals met: 6 of 13
86. (load hoist2 crate11 truck1 distributor1)
   deleted: (lifting hoist2 crate11)
   added: (in crate11 truck1) (available hoist2)
   goals met: 6 of 13
87. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 6 of 13
88. (unload hoist0 crate11 truck1 depot0)
   deleted: (in crate11 truck1) (available hoist0)
   added: (lifting hoist0 crate11)
   goals met: 6 of 13
89. (drop hoist0 crate11 pallet0 depot0)
   deleted: (lifting hoist0 crate11) (clear pallet0)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 pallet0)
   goals met: 7 of 13
90. (unload hoist0 crate10 truck1 depot0)
   deleted: (in crate10 truck1) (available hoist0)
   added: (lifting hoist0 crate10)
   goals met: 7 of 13
91. (drop hoist0 crate10 crate11 depot0)
   deleted: (lifting hoist0 crate10) (clear crate11)
   added: (available hoist0) (at crate10 depot0) (clear crate10) (on crate10 crate11)
   goals met: 8 of 13
92. (unload hoist0 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 8 of 13
93. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 8 of 13
94. (lift hoist2 crate5 crate3 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate3)
   added: (lifting hoist2 crate5) (clear crate3)
   goals met: 8 of 13
95. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   goals met: 8 of 13
96. (lift hoist2 crate3 pallet2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 pallet2)
   added: (lifting hoist2 crate3) (clear pallet2)
   goals met: 8 of 13
97. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 8 of 13
98. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   goals met: 8 of 13
99. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 8 of 13
100. (drop hoist0 crate4 crate13 depot0)
   deleted: (lifting hoist0 crate4) (clear crate13)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate13)
   goals met: 8 of 13
101. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 8 of 13
102. (drop hoist0 crate5 crate4 depot0)
   deleted: (lifting hoist0 crate5) (clear crate4)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate4)
   goals met: 9 of 13
103. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 9 of 13
104. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   goals met: 9 of 13
105. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   goals met: 9 of 13
106. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 9 of 13
107. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 9 of 13
108. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 9 of 13
109. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 9 of 13
110. (drop hoist1 crate2 crate7 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate7)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate7)
   goals met: 9 of 13
111. (unload hoist1 crate3 truck1 distributor0)
   deleted: (in crate3 truck1) (available hoist1)
   added: (lifting hoist1 crate3)
   goals met: 9 of 13
112. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 9 of 13
113. (lift hoist0 crate5 crate4 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate4)
   added: (lifting hoist0 crate5) (clear crate4)
   goals met: 8 of 13
114. (load hoist0 crate5 truck1 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck1) (available hoist0)
   goals met: 8 of 13
115. (lift hoist0 crate4 crate13 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate13)
   added: (lifting hoist0 crate4) (clear crate13)
   goals met: 8 of 13
116. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 8 of 13
117. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 8 of 13
118. (lift hoist1 crate2 crate7 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate7)
   added: (lifting hoist1 crate2) (clear crate7)
   goals met: 8 of 13
119. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 8 of 13
120. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 8 of 13
121. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 8 of 13
122. (drop hoist0 crate3 crate13 depot0)
   deleted: (lifting hoist0 crate3) (clear crate13)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate13)
   goals met: 9 of 13
123. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 9 of 13
124. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   goals met: 9 of 13
125. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   goals met: 9 of 13
126. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 9 of 13
127. (drop hoist2 crate4 pallet2 distributor1)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 pallet2)
   goals met: 10 of 13
128. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 10 of 13
129. (unload hoist2 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist2)
   added: (lifting hoist2 crate5)
   goals met: 10 of 13
130. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 10 of 13
131. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 10 of 13
132. (drop hoist0 crate6 crate3 depot0)
   deleted: (lifting hoist0 crate6) (clear crate3)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate3)
   goals met: 11 of 13
133. (drop hoist2 crate5 crate4 distributor1)
   deleted: (lifting hoist2 crate5) (clear crate4)
   added: (available hoist2) (at crate5 distributor1) (clear crate5) (on crate5 crate4)
   goals met: 12 of 13
134. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 12 of 13
135. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   goals met: 12 of 13
136. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 12 of 13
137. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   goals met: 12 of 13
138. (drop hoist2 crate2 crate5 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate5)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate5)
   goals met: 13 of 13
